

#최신화데이터
GE_list = {'기초글쓰기': {'subject': '기초글쓰기', 'score': 2, 'category': '교필'},
           '사회봉사': {'subject': '사회봉사', 'score':1, 'category':'교필'},
           '영어커뮤니케이션(1)': {'subject': '영어커뮤니케이션(1)', 'score':2, 'category':'교필'},
           '영어커뮤니케이션(2)': {'subject': '영어커뮤니케이션(2)', 'score':2, 'category':'교필'},
           '현대인과성경': {'subject':'현대인과성경', 'score':3, 'category':'교필'},
           '현대인과기독교': {'subject':'현대인과기독교', 'score':3, 'category':'교필'},
           '대학생활과진로': {'subject':'대학생활과진로', 'score':1, 'category':'교필'},
           '컴퓨팅사고와 코딩기초': {'subject': '컴퓨팅사고와 코딩기초', 'score': 2, 'category': '교필'},}

GE_change = {
	'Lab(1)': '영어커뮤니케이션(1)',
	'Lab(2)': '영어커뮤니케이션(2)',
	'파이데이아포럼(1)': '파이데이아포럼',
	'파이데이아포럼(2)': '대학생활과진로',
	'파이데이아포럼': '대학생활과진로'
}

#산경데이터
IME = {
    "REQ": {
        2017:["공학통계(1)", "경영과학(1)", "제품기획및개발"],
        2018:["공학통계(1)", "캡스톤디자인"],
        2019:["공학통계(1)", "캡스톤디자인"],
        2020:["공학통계(1)", "캡스톤디자인"],
        2021:["공학통계(1)", "캡스톤디자인"],
        2022:["공학통계(1)", "캡스톤디자인"],
        2023:["공학통계(1)", "캡스톤디자인"],
        2024:[]
    },

    "change":{
        "경영과학(1)" : "경영과학",
        "취업과진로" : "진로와취창업",
        "컴퓨터프로그래밍(2)" : "객체지향 프로그래밍 언어",
        "컴퓨터프로그래밍(1)" : "인공지능 파이썬 프로그래밍",
        "작업설계" : "작업 분석 및 설계",
        "데이터분석실무" : "데이터분석및설계",
        "원가공학" : "원가공학(원격수업)",
        "산업경영공학실무(2)" : "산업경영공학실무",
        "공학수학":"선형대수학",
        "인공지능 파이썬 프로그래밍":"파이썬프로그래밍",
        "데이터베이스":"데이터베이스 활용",
        "빅데이터와머신러닝":"빅데이터와머신러닝(원격병행수업)",
    },

    "list" : {
        "미적분학": {'subject':'미적분학','score':3,'category':'전선'},
        "산업경영공학개론": {'subject':'산업경영공학개론','score':3,'category':'전선'},
        "공학통계(1)": {'subject':'공학통계(1)','score':3,'category':'전필'},
        "경영과학": {'subject':'경영과학','score':3,'category':'전선'},
        "제조및생산시스템개론": {'subject':'제조및생산시스템개론','score':3,'category':'전선'},
        "진로와취창업": {'subject':'진로와취창업','score':2,'category':'전선'},
        "객체지향 프로그래밍 언어": {'subject':'객체지향 프로그래밍 언어','score':3,'category':'전선'},
        "생산운영관리": {'subject':'생산운영관리','score':3,'category':'전선'},
        "경영과학(2)": {'subject':'경영과학(2)','score':3,'category':'전선'},
        "시스템시뮬레이션": {'subject':'시스템시뮬레이션','score':3,'category':'전선'},
        "신뢰성공학": {'subject':'신뢰성공학','score':3,'category':'전선'},
        "캡스톤디자인": {'subject':'캡스톤디자인','score':3,'category':'전필'},
        "품질경영실무": {'subject':'품질경영실무','score':3,'category':'전선'},
        "선형대수학": {'subject':'선형대수학','score':3,'category':'전선'},
        "파이썬프로그래밍": {'subject':'파이썬프로그래밍','score':3,'category':'전선'},
        "데이터베이스 활용": {'subject':'데이터베이스 활용','score':3,'category':'전선'},
        "공학통계(2)": {'subject':'공학통계(2)','score':3,'category':'전선'},
        "원가공학(원격수업)": {'subject':'원가공학(원격수업)','score':3,'category':'전선'},
        "작업 분석 및 설계": {'subject':'작업 분석 및 설계','score':3,'category':'전선'},
        "제품기획및개발": {'subject':'제품기획및개발','score':3,'category':'전선'},
        "경제성공학": {'subject':'경제성공학','score':3,'category':'전선'},
        "실험계획의원리": {'subject':'실험계획의원리','score':3,'category':'전선'},
        "품질관리": {'subject':'품질관리','score':3,'category':'전선'},
        "물류및시설계획": {'subject':'물류및시설계획','score':3,'category':'전선'},
        "데이터분석및설계": {'subject':'데이터분석및설계','score':3,'category':'전선'},
        "인간공학": {'subject':'인간공학','score':3,'category':'전선'},
        "산업경영공학실무": {'subject':'산업경영공학실무','score':3,'category':'전선'},
        "빅데이터와머신러닝(원격병행수업)": {'subject':'빅데이터와머신러닝(원격병행수업)','score':3,'category':'전선'},
        "확률과통계":{'subject':'확률과통계','score':3,'category':'전선'},
    },

    "grad" : {
        2017:["졸업작품", "졸업논문", "품질경영기사", "토익 800점 이상"],
        2018:["졸업작품", "졸업논문", "품질경영기사", "토익 800점 이상"],
        2019:["졸업작품", "졸업논문", "품질경영기사", "토익 800점 이상"],
        2020:["졸업작품", "졸업논문", "품질경영기사", "토익 800점 이상"],
        2021:["졸업작품", "졸업논문", "품질경영기사", "토익 800점 이상"],
        2022:["졸업작품", "졸업논문", "품질경영기사", "빅데이터 분석 기사"],
        2023:["졸업작품", "졸업논문", "품질경영기사", "빅데이터 분석 기사"],
        2024:[],
    }
}

# 미소과
MS = {
    "REQ":{
        2017:["미디어소프트웨어기초설계", "자료구조", "멀티미디어통신", "멀티미디어프로그래밍(1)", 
              "자바웹프로그래밍", "데이터베이스(1)", "게임수학", "모바일컴퓨팅(1)", "게임프로그래밍(1)", 
              "컴퓨터그래픽스(1)", "HCI", "영상처리", "미디어소프트웨어종합설계(1)", "미디어소프트웨어종합설계(2)", "졸업작품"],
        
        2018:["미디어소프트웨어기초설계", "자료구조및알고리즘", "멀티미디어통신", "멀티미디어프로그래밍", 
              "자바웹프로그래밍(1)", "데이터베이스(1)", "게임수학", "모바일컴퓨팅(1)", "게임프로그래밍(1)", "HCI", 
              "컴퓨터그래픽스(1)", "영상처리", "미디어소프트웨어종합설계(1)", "미디어소프트웨어종합설계(2)", "졸업작품"],
        2019:["미디어소프트웨어기초설계", "자료구조및알고리즘", "멀티미디어통신", "멀티미디어프로그래밍", 
              "자바웹프로그래밍(1)", "데이터베이스(1)", "게임수학", "모바일컴퓨팅(1)", "게임프로그래밍(1)", "HCI", 
              "컴퓨터그래픽스(1)", "영상처리", "미디어소프트웨어종합설계(1)", "미디어소프트웨어종합설계(2)", "졸업작품"],
        2020:["미디어소프트웨어기초설계", "자료구조및알고리즘", "멀티미디어통신", "멀티미디어프로그래밍", 
              "자바웹프로그래밍(1)", "데이터베이스(1)", "게임수학", "모바일컴퓨팅(1)", "게임프로그래밍(1)", "HCI", 
              "컴퓨터그래픽스(1)", "영상처리", "미디어소프트웨어종합설계(1)", "미디어소프트웨어종합설계(2)", "졸업작품"],
        
        2021:["게임/가상현실콘텐츠기획", "자료구조및알고리즘", "자바웹프로그래밍(1)", "게임수학", 
              "데이터베이스", "영상처리", "앱프로그래밍(1)", "게임엔진(1)", "컴퓨터그래픽스(1)", "HCI", 
              "미디어소프트웨어종합설계(1)", "미디어소프트웨어종합설계(2)", "졸업작품"],
        2022:["게임/가상현실콘텐츠기획", "자료구조및알고리즘", "자바웹프로그래밍(1)", "게임수학", 
              "데이터베이스", "영상처리", "앱프로그래밍(1)", "게임엔진(1)", "컴퓨터그래픽스(1)", "HCI", 
              "미디어소프트웨어종합설계(1)", "미디어소프트웨어종합설계(2)", "졸업작품"],
        2023:["게임/가상현실콘텐츠기획", "자료구조및알고리즘", "자바웹프로그래밍(1)", "게임수학", 
              "데이터베이스", "영상처리", "앱프로그래밍(1)", "게임엔진(1)", "컴퓨터그래픽스(1)", "HCI", 
              "미디어소프트웨어종합설계(1)", "미디어소프트웨어종합설계(2)", "졸업작품"],
        2024:[]
        
        },
    
    "change":{
        "자료구조": "자료구조및알고리즘",
        "멀티미디어소프트웨어개론(1학년)": "멀티미디어소프트웨어개론",
        "멀티미디어통신": "게임/가상현실콘텐츠기획",
        "자바웹프로그래밍(1)(2학년)" : "자바웹프로그래밍(1)",
        "정보사회의이해":"멀티미디어소프트웨어개론", 
        "미디어소프트웨어종합설계(1)": "미디어소프트웨어종합설계",
        "게임프로그래밍(1)": "게임엔진(1)",
        "C프로그래밍(2)": "파이썬프로그래밍",
        "알고리즘":"운영체제",
        
        "데이터베이스(1)": "데이터베이스",
        "데이터베이스(2)": "서버프로그래밍",
        
        "직업과윤리":"취업과진로", # 대체
        "취업과진로": "진로와취창업", # 폐지후 대체 2학점
        
        "멀티미디어프로그래밍(1)": "멀티미디어프로그래밍", # 대체
        "멀티미디어프로그래밍": "C프로그래밍", # 폐지 후 대체
        
        "멀티미디어프로그래밍(2)":"모바일컴퓨팅(1)", # 대체
        "모바일컴퓨팅(1)":"앱프로그래밍(1)" # 폐지 후 대체
        
    },

    "list":{
        "게임/가상현실콘텐츠기획": {'subject':'게임/가상현실콘텐츠기획','score':3,'category':'전필'},
        "자료구조및알고리즘": {'subject':'자료구조및알고리즘','score':3,'category':'전필'},
        "자바웹프로그래밍(1)": {'subject':'자바웹프로그래밍(1)','score':3,'category':'전필'},
        "게임수학": {'subject':'게임수학','score':3,'category':'전필'},
        "데이터베이스": {'subject':'데이터베이스','score':3,'category':'전필'},
        "영상처리": {'subject':'영상처리','score':3,'category':'전필'},
        "앱프로그래밍(1)": {'subject':'앱프로그래밍(1)','score':3,'category':'전필'},
        "게임엔진(1)": {'subject':'게임엔진(1)','score':3,'category':'전필'},
        "컴퓨터그래픽스(1)": {'subject':'컴퓨터그래픽스(1)','score':3,'category':'전필'},
        "HCI": {'subject':'HCI','score':3,'category':'전필'},
        "미디어소프트웨어종합설계(2)": {'subject':'미디어소프트웨어종합설계(2)','score':3,'category':'전필'},
        "졸업작품": {'subject':'졸업작품','score':0,'category':'전필'},

        "C프로그래밍": {'subject':'C프로그래밍','score':3,'category':'전선'},
        "멀티미디어소프트웨어개론": {'subject':'멀티미디어소프트웨어개론','score':3,'category':'전선'},
        "디지털스토리텔링": {'subject':'디지털스토리텔링','score':3,'category':'전선'},
        "대학수학": {'subject':'대학수학','score':3,'category':'전선'},
        "디지털디자인": {'subject':'디지털디자인','score':3,'category':'전선'},
        "머신러닝 기초": {'subject':'머신러닝 기초','score':3,'category':'전선'},
        "진로탐색(1)": {'subject':'진로탐색(1)','score':3,'category':'전선'},
        "서버프로그래밍": {'subject':'서버프로그래밍','score':3,'category':'전선'},
        "앱프로그래밍(2)": {'subject':'앱프로그래밍(2)','score':3,'category':'전선'},
        "3D 모델링": {'subject':'3D 모델링','score':3,'category':'전선'},
        "운영체제": {'subject':'운영체제','score':3,'category':'전선'},
        "가상현실/증강현실콘텐츠제작": {'subject':'가상현실/증강현실콘텐츠제작','score':3,'category':'전선'},
        "파이썬프로그래밍": {'subject':'파이썬프로그래밍','score':3,'category':'전선'},
        "C++ 프로그래밍": {'subject':'C++ 프로그래밍','score':3,'category':'전선'},
        "미디어소프트웨어기초설계": {'subject':'미디어소프트웨어기초설계','score':3,'category':'전선'},
        "이산수학": {'subject':'이산수학','score':3,'category':'전선'},
        "자바웹프로그래밍(2)": {'subject':'자바웹프로그래밍(2)','score':3,'category':'전선'},
        "진로탐색(2)": {'subject':'진로탐색(2)','score':3,'category':'전선'},
        "인공지능": {'subject':'인공지능','score':3,'category':'전선'},
        "게임엔진(2)": {'subject':'게임엔진(2)','score':3,'category':'전선'},
        "컴퓨터그래픽스(2)": {'subject':'컴퓨터그래픽스(2)','score':3,'category':'전선'},
        "미디어소프트웨어종합설계": {'subject':'미디어소프트웨어종합설계','score':3,'category':'전필'},
        "취창업세미나": {'subject':'취창업세미나','score':3,'category':'전선'},
        
        "진로와 취창업": {'subject':'진로와 취창업','score':2,'category':'전선'},
        
        "현장실습(1)": {'subject':'현장실습(1)','score':3,'category':'전선'}, # 학점 미정
        "현장실습(2)": {'subject':'현장실습(2)','score':3,'category':'전선'}, # 학점 미정
        "현장실습(3)": {'subject':'현장실습(3)','score':3,'category':'전선'}, # 학점 미정
        "현장실습(4)": {'subject':'현장실습(4)','score':3,'category':'전선'}  # 학점 미정
        },
    
    "grad":{2017:[],2018:[],2019:[],2020:["ㅎㅎ"],2021:[],2022:[],2023:[],2024:[]}
}


# 경영학과
BN = {
    "REQ": {
        2017:["Business English(1)", "Business English(2)"], # 모두 2학점
        2018:["Business English(1)", "Business English(2)"],
        2019:["Business English(1)", "Business English(2)"],
        2020:["비즈니스영어(1)", "비즈니스영어(2)"],
        2021:["비즈니스영어(1)", "비즈니스영어(2)"],
        2022:["비즈니스영어(1)", "비즈니스영어(2)"],
        2023:["비즈니스영어(1)", "비즈니스영어(2)"],
        2024:["비즈니스영어(1)", "비즈니스영어(2)"]
    },

    "change":{
        "취업과진로" : "진로와취창업"
    },

    "list" : {
        "진로와취창업": {'subject':'진로와취창업','score':2,'category':'전선'},
        
        "회계원리": {'subject':'회계원리','score':3,'category':'전선'},
        "기업경영의이해": {'subject':'기업경영의이해','score':3,'category':'전선'},
        "재무관리": {'subject':'재무관리','score':3,'category':'전선'},
        "국제경영론": {'subject':'국제경영론','score':3,'category':'전선'},
        "마케팅론": {'subject':'마케팅론','score':3,'category':'전선'},
        "중급회계": {'subject':'중급회계','score':3,'category':'전선'},
        "국제마케팅": {'subject':'국제마케팅','score':3,'category':'전선'},
        "선물시장옵션론": {'subject':'선물시장옵션론','score':3,'category':'전선'},
        "세무회계": {'subject':'세무회계','score':3,'category':'전선'},
        "다국적기업론": {'subject':'다국적기업론','score':3,'category':'전선'},
        "인적자원관리": {'subject':'인적자원관리','score':3,'category':'전선'},
        "소비자행동론": {'subject':'소비자행동론','score':3,'category':'전선'},
        "품질운영론": {'subject':'품질운영론','score':3,'category':'전선'},
        "무역실무론": {'subject':'무역실무론','score':3,'category':'전선'},
        "마케팅리서치": {'subject':'마케팅리서치','score':3,'category':'전선'},
        "핀테크론": {'subject':'핀테크론','score':3,'category':'전선'},
        "경제학원론": {'subject':'경제학원론','score':3,'category':'전선'},
        "경영과통계": {'subject':'경영과통계','score':3,'category':'전선'},
        "창업전략론": {'subject':'창업전략론','score':3,'category':'전선'},
        "국제기업환경론": {'subject':'국제기업환경론','score':3,'category':'전선'},
        "투자론": {'subject':'투자론','score':3,'category':'전선'},
        "인적자원관리": {'subject':'인적자원관리','score':3,'category':'전선'},
        "Web마케팅": {'subject':'Web마케팅','score':3,'category':'전선'},
        "경영정보시스템": {'subject':'경영정보시스템','score':3,'category':'전선'},
        "재무분석론": {'subject':'재무분석론','score':3,'category':'전선'},
        "원가회계": {'subject':'원가회계','score':3,'category':'전선'},
        "경영전략": {'subject':'경영전략','score':3,'category':'전선'},
        "금융시장론": {'subject':'금융시장론','score':3,'category':'전선'},
        "관리회계": {'subject':'관리회계','score':3,'category':'전선'},
        "SCM": {'subject':'SCM','score':3,'category':'전선'},
        "NCS와노사관계론": {'subject':'NCS와노사관계론','score':3,'category':'전선'},
        "광고론": {'subject':'광고론','score':3,'category':'전선'},
        
        
        "Business English(1)": {'subject':'Business English(1)','score':2,'category':'전필'},
        "Business English(2)": {'subject':'Business English(2)','score':2,'category':'전필'},
        "비즈니스영어(1)": {'subject':'비즈니스영어(1)','score':2,'category':'전필'},
        "비즈니스영어(2)": {'subject':'비즈니스영어(2)','score':2,'category':'전필'}
    },

    "grad":{
        2017:["졸업논문", "졸업 대체 자격증 취득"],
        2018:["졸업논문", "졸업 대체 자격증 취득"],
        2019:["졸업논문", "졸업 대체 자격증 취득"],
        2020:["졸업논문", "졸업 대체 자격증 취득"],
        2021:["졸업논문", "졸업 대체 자격증 취득"],
        2022:["졸업논문", "졸업 대체 자격증 취득"],
        2023:["졸업논문", "졸업 대체 자격증 취득"],
        2024:["졸업논문", "졸업 대체 자격증 취득"]
        }
}

#지원학과
CM_list = {"산업경영공학과":IME,
           "미디어소프트웨어학과":MS,
           "경영학과":BN}
