GE = {'English': ['Lab(1)', 'Lab(2)', '영어커뮤니케이션(1)', '영어커뮤니케이션(2)'],
        'English_cnt': [0, 2], # count ,max
        '기초글쓰기': [0, 1], # 1
        '사회봉사': [0, 1], # 1
        '현대인과성경': [0, 1], # 1
        '현대인과기독교': [0, 1], # 1
        'other': ['파이데이아포럼(1)', '파이데이아포럼(2)', '파이데이아포럼', '대학생활과진로'],
        'other_cnt': [0, 2], # 2
        'one_point': ['기초글쓰기', '사회봉사', '현대인과성경', '현대인과기독교'],
        'for_loop': {'English_cnt': 0, '기초글쓰기': 0, '사회봉사': 0, '현대인과성경': 0, '현대인과기독교': 0, 'other_cnt': 0}
        }

GE_list = {'기초글쓰기': {'subject': '기초글쓰기', 'score': 2, 'category': '교필'},
           '사회봉사': {'subject': '사회봉사', 'score':2, 'category':'교필'},
           '영어커뮤니케이션(1)': {'subject': '영어커뮤니케이션(1)', 'score':2, 'category':'교필'},
           '영어커뮤니케이션(2)': {'subject': '영어커뮤니케이션(2)', 'score':2, 'category':'교필'},
           '현대인과성경': {'subject':'현대인과성경', 'score':3, 'category':'교필'},
           '현대인과기독교': {'subject':'현대인과기독교', 'score':3, 'category':'교필'},
           '대학생활과진로': {'subject':'대학생활과진로', 'score':1, 'category':'교필'},
           '파이데이아포럼': {'subject':'파이데이아포럼', 'score':1, 'category':'교필'},}